000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КлассификаторБанков/КлассификаторБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторБанков</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интеграция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаМинимальногоКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнтернетБанкинга</name>
    <comment>Предоставление услуги с помощью API банка</comment>
    <type>
      <types>EnumRef.ТипыИнтернетБанкинга</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИнкассатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУпаковкиПриИнкассации</name>
    <type>
      <types>EnumRef.ВидУпаковкиПриИнкассации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИнкассации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресацияAPI</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>ID нашей организации в банке</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <comment>Секретный ключ доступа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>EnumRef.ТипыУслугБанка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КлассификаторБанков/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Функция формирует дерево классификатора из макета хранимого в конфигурации
Функция ПолучитьДеревоКлассификатора() Экспорт
	
	
	КлассификаторXML = Справочники.КлассификаторБанков.ПолучитьМакет("КлассификаторБанков").ПолучитьТекст();
	
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;

	Дерево = Новый ДеревоЗначений;
	Дерево.Колонки.Добавить("Уровень",      Новый ОписаниеТипов("Число"));
	Дерево.Колонки.Добавить("МФО",          Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Город",        Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Адрес",        Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КодПоЕДРПОУ",  Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Телефоны",     Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("КоррСчет",     Новый ОписаниеТипов("Строка"));
	Для Каждого КлассификаторЗапись Из КлассификаторТаблица Цикл
		
		Если КлассификаторЗапись.Level = "1" ИЛИ КлассификаторЗапись.Level = 1 Тогда
			СтрокаУровень1 = Дерево.Строки.Добавить();
			НоваяСтрока = СтрокаУровень1;
		Иначе
			НоваяСтрока = СтрокаУровень1.Строки.Добавить();		
		КонецЕсли;
		
		НоваяСтрока.Уровень      = КлассификаторЗапись.Level;
		НоваяСтрока.МФО          = КлассификаторЗапись.MFO;
		НоваяСтрока.Наименование = КлассификаторЗапись.Name;
		НоваяСтрока.Город        = КлассификаторЗапись.City;
		НоваяСтрока.Адрес        = КлассификаторЗапись.Address;
		НоваяСтрока.КодПоЕДРПОУ  = КлассификаторЗапись.Code;
		НоваяСтрока.Телефоны     = КлассификаторЗапись.Tel;
		НоваяСтрока.КоррСчет     = КлассификаторЗапись.CorrAccount;
	КонецЦикла;
	
	Возврат Дерево;
	
КонецФункции

#КонецЕсли
